//package com.HeadFirstJava.page117;
//
//public class calcArea {
//    int calcArea (int height, int widht) {
//        return height * widht;
//    }
//
//    int a = calcArea (7, 12);
//    short c = 7;
//
//    calcArea (c,15); // Нельзя вызвать метод, не присвоив его результат переменной, если бы присвоили - ошибка ушла бы
//
//    int d = calcArea (57); // Нельзя вызвать метод, не передав ему нужные значения
//
//    calcArea (2,3); // Нельзя вызвать метод, не присвоив его результат переменной, если бы присвоили - ошибка ушла бы
//
//    long t = 42;
//    int f = calcArea (t, 17); //Нельзя передавать в метод, значение long больше требуемого int
//    int g = calcArea (); // Нельзя вызывать метод без параметров
//
//    calcArea (); // Нельзя вызывать метод без параметров и не присваивать его результат переменной
//
//    byte h = calcArea (4, 20);
//    int j = calcArea (2, 3, 5); //Нельзя передавать в метод больше или меньше параметров чем нужно
//}
