package com.javarush.task.task01.task0132;

/* 
Сумма цифр трехзначного числа

Код реалізує підрахунок суми цифр у заданому числі.
Для цього спочатку задане число конвертується в рядок (стрічку)
за допомогою операції конкатенації (додавання строки до числа).
Далі створюється змінна sum, яка ініціалізується нулем,
і в циклі for посимвольно обчислюється сума цифр у числі,
додаванням числового значення кожного символу за допомогою
методу Character.getNumericValue(). На кожній ітерації циклу
значення sum збільшується на цифру, яку представляє поточний символ.
У кінці метод повертає обчислену суму.

Для прикладу, якщо задане число 546, то рядок str буде мати значення "546".
У циклі for спочатку обчислюється значення цифри 5 (індекс 0),
потім - 4 (індекс 1) і нарешті - 6 (індекс 2). Сума всіх цифр дорівнює 5 + 4 + 6 = 15.
*/

public class Solution {
    public static void main(String[] args) {
        // Виклик методу sumDigitsInNumber з аргументом 546 і виведення результату
        System.out.println(sumDigitsInNumber(546));
    }

    public static int sumDigitsInNumber(int number) {
        // Перетворення числа number в рядок і зберігання його у змінній str
        String str = "" + number;
        // Ініціалізація змінної sum, яка буде містити суму цифр числа
        int sum = 0;
        // Початок циклу, який буде проходити по кожній цифрі числа
        for (int i = 0; i < str.length(); i++) {
            // Додавання цифри до суми за допомогою методу Character.getNumericValue()
            sum += Character.getNumericValue(str.charAt(i));
        }
        // Повернення результату - суми цифр числа
        return sum;
    }
}
