package com.javarush.task.task04.cycles;

/*
package com.javarush.task.task04.task0430;

Вывести на экран числа от 1 до 10 включительно, используя цикл while.
Каждое значение с новой строки.
 */
public class Task1 {
    public static void main (String[] args) {
        int i = 1;
        while (i <= 10) {
            System.out.println (i);
            i++;
        }
    }
}