package com.servitant.level4;

public class TestHotKeys {

/*  ctrl + J - посмотреть все сокращения
    main + tab, psvm + tab - создаем метод public static void main (String[] args)
    sout+tab - создаем метод вывода на экран System.out.println ()

    ctrl + / - закомментировать выделенную область //
    ctrl + shift + / - закомментировать выделенную область - косая+звездочка
    tab - сдвигает строку или выделенную область вправо
    shift + tab - сдвигает строку или выделенную область влево

    ctrl + D - скопировать всю строку курсором
    ctrl + W - выделить "поблочно" (слово, строку, абзац, блок и т.д.)
    ctrl + shift + W - отменяет выделение "поблочно" (слово, строку, абзац, блок и т.д.)
    ctrl + Y - удалить строку под курсором
    ctrl + X - вырезать строку под курсором
    ctrl + "+" - развернуть блок под курсором
    ctrl + "-" - свернуть блок под курсором
    ctrl + shift + "+" - развернуть всё
    ctrl + shift + "-" - свернуть всё
    ctrl + [ - перейти в начало метода на фигурную скобку { (работает на латинской раскладке)
    ctrl + ] - перейти в конец метода на фигурную скобку } (работает на латинской раскладке)
    ctrl + G - перейти на указанную строку
    ctrl + backspace - удалить слово перед курсором
    ctrl + del - удалить слово после курсора

    alt+enter - подключить библиотку
    alt+insert - создать констркутор/геттер/сеттер
*/


    }
}
