package com.javarush.array.task;
/*Даний код містить клас Ceasar, який містить статичний метод encryption.
Цей метод приймає два параметри: рядок тексту text, який буде зашифровано,
і ціле число step, яке представляє крок шифрування.

Алгоритм шифрування, використовуваний у цьому методі, відомий як шифр Цезаря.
Він полягає в заміні кожного символу тексту іншим символом, розміщеним на певній кількості позицій в алфавіті.

У методі encryption, спочатку створюється порожній рядок res,
в який будуть додаватися зашифровані символи. Також створюються два масиви символів:
lowChars і upChars, які містять нижній та верхній регістри літер в російській абетці відповідно.

Потім використовуючи цикл for, кожен символ рядка text перетворюється на масив символів за допомогою методу toCharArray().
Для кожного символу перевіряється, чи він є літерою (а не пробілом чи іншим знаком пунктуації)
за допомогою методу Character.isWhitespace(). Якщо символ є літерою, то виконується подальша обробка.

Для кожної літери перевіряється, чи вона знаходиться у нижньому або верхньому регістрі
за допомогою методів Character.isLowerCase() і Character.isUpperCase().
Для кожного з регістрів масив символів lowChars і upChars відповідно проходиться цикл,
доки не знайдено відповідний символ, індекс якого зберігається у змінній index.
Потім до індексу додається значення step. Якщо новий індекс виходить за межі масиву,
то він зміщується назад на довжину масиву за допомогою оператора %.
Останній зашифрований символ додається до рядку res.*/

public class Ceasar {
    public static String encryption(String text, int step) {
        String res = "";

        char[] textChar = text.toCharArray();
        char[] lowChars = {'а', 'б', 'в', 'г', 'д', 'е', 'ё', 'ж',
                'з', 'и', 'й', 'к', 'л', 'м', 'н', 'о', 'п', 'р', 'с',
                'т', 'у', 'ф', 'х', 'ц', 'ч', 'ш', 'щ', 'ъ', 'ы', 'ь', 'э', 'ю', 'я'};
        char[] upChars = {'А', 'Б', 'В', 'Г', 'Д', 'Е', 'Ё', 'Ж',
                'З', 'И', 'Й', 'К', 'Л', 'М', 'Н', 'О', 'П', 'Р', 'С', 'Т', 'У', 'Ф', 'Х',
                'Ц', 'Ч', 'Ш', 'Щ', 'Ы', 'Ь', 'Э', 'Ю', 'Я'};

        for(int i = 0; i < textChar.length; i++) {
            int index = 0;
            boolean isNOTLetter = Character.isWhitespace(textChar[i]);
            if(!isNOTLetter){
                if(Character.isLowerCase(textChar[i])){
                    while (textChar[i] != lowChars[index]) index++;
                    index += step;
                    if(index > 32){
                        index -= 33;
                    }
                    textChar[i] = lowChars[index];
                } else if(Character.isUpperCase(textChar[i])){
                    while (textChar[i] != upChars[index]) index++;
                    index += step;
                    if(index > 32){
                        index -= 33;
                    }
                    textChar[i] = upChars[index];
                }
            }
        }
        for(char c: textChar) {
            res += c;
        }
        return res;
    }//текст, выделенный жирным шрифтом
}
