package com.javarush.task.task01.task0133;

/* 
Не думать о секундах…

Цей код обчислює кількість секунд, що пройшли в поточній годині
на основі загальної кількості секунд, яка була передана у метод getCountSecondsPassedInCurrentHour().

Спочатку метод ділить кількість секунд seconds на 3600, щоб отримати загальну кількість годин, які пройшли.
Результат цієї операції зберігається в змінну hour. Далі, використовуючи це значення,
метод вираховує кількість секунд, які пройшли в поточній годині,
віднімаючи від загальної кількості секунд кількість годин, які пройшли, помножену на 3600.
Результат повертається з методу і виводиться на екран за допомогою методу println() в методі main().

Метод getCountSecondsPassedInCurrentHour дозволяє отримати кількість секунд, що пройшли в поточній годині,
виходячи з загальної кількості секунд, що пройшли з початку доби.

Наприклад, якщо ми знаємо, що від початку доби (00:00:00) пройшло 7200 секунд (це означає 02:00:00),
то за допомогою методу getCountSecondsPassedInCurrentHour ми можемо дізнатися,
що вже пройшло 7200 - 2*3600 = 1200 секунд (це означає, що залишилося ще 3600 - 1200 = 2400 секунд до кінця години).
Це може бути корисно в різних сферах, наприклад, в програмуванні годинника або таймера.
*/

public class Solution {
    public static void main(String[] args) {
        System.out.println(getCountSecondsPassedInCurrentHour(12345));
    }

    public static int getCountSecondsPassedInCurrentHour(int seconds) {
        //напишите тут ваш код
        int hour = seconds / 3600;
        return seconds - hour * 3600;
    }
}